levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
  }
  else
  {
    if(pos==g_userdata_firstpos)
    {//current block is the first block
       nextpos=g_userdata.p_data[pos+1];                 
       g_userdata.p_data[nextpos*MAX_USERDATA_BUFFER_BLOCKSIZE+2]=0x00;
       g_userdata_currpos=nextpos;
    }
    else if (pos==g_userdata_lastpos)
    {//current block is the last block
      prepos=g_userdata.p_data[pos+2];
       g_userdata.p_data[prepos*MAX_USERDATA_BUFFER_BLOCKSIZE+1]=0x00;
      g_userdata_currpos=g_userdata_firstpos;
    }
    else{
       nextpos=g_userdata.p_data[pos+1];
       prepos=g_userdata.p_data[pos+2];
       g_userdata.p_data[nextpos*MAX_USERDATA_BUFFER_BLOCKSIZE+2]=prepos;
       g_userdata.p_data[prepos*MAX_USERDATA_BUFFER_BLOCKSIZE+1]=nextpos;
       g_userdata_currpos=nextpos;
    }
    g_userdata.size--;



  }
    uart_printf("delete block %d \n\r",pos1);
  if(cond==true)
  {// add ids to history buffer
      vf_add_buff_adv_hist3(ids);
  }
}





/*---------------------
@Brief: advertising a packet in buffer by pasting it to user data field of adv struct
g_userdata_currpos: packet to be sent
g_userdata_firstpos: first packet block in buffer
g_userdata_lastpos: last packet block in buffer
g_userdata.size: number of used block in buffer
*/

void relay_adv_data2(void)
{

    ret_code_t err_code;
    uint8_t i,j=0;

    uint8_t advlen=org_adv_data_size;
    static uint8_t relay_data[32];
     uint16_t pos=g_userdata_firstpos;
    uint8_t relay_size;

    while(g_userdata.size>0) //check nubmer of used block
    {
          pos=g_userdata_currpos;
          if(g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4]==0)
          {//size of data =0 ->delete block
            vf_delete_block_buffer();
          }
          else if(g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4+4]>=4) //max TTL=4
          {//TTL expired ->delete block
            vf_delete_block_buffer();
          }
          else
          {
            if(g_userdata_currpos==g_userdata_lastpos) //reach lastpos -> first pos 
                g_userdata_currpos=g_userdata_firstpos;
            else
              g_userdata_currpos=g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+1];

            relay_size= g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4];
            g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4+4]++; //increase TTL

            relay_data[0]=relay_size;
            relay_data[1]=0xff; //type: MANUFACTURER  
            memcpy(&relay_data[2],&g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5],relay_size);
            memcpy(&adv_packet.adv_data.p_data[advlen],relay_data,relay_size+1);
            adv_packet.adv_data.len=org_adv_data_size+relay_size+1;

             uart_printf("adv relay data *%d (len)%d @%d",j,adv_packet.adv_data.len,pos );
              j++;
             for(int i=0;i<adv_packet.adv_data.len;i++)
              {
                uart_printf("%d  ",adv_packet.adv_data.p_data[i] );
              }
              uart_printf("\n\r"); 
            break;
          }

    }//while
   
}


/*---------------------
@Brief: advertising a packet in buffer by pasting it to user data field of adv struct
g_userdata_currpos: packet to be sent
g_userdata_firstpos: first packet block in buffer
g_userdata_lastpos: last packet block in buffer
g_userdata.size: number of used block in buffer
*/

void vf_relay_adv_data3(void* p_indata)
{

    ret_code_t err_code;
    uint8_t i,j=0;

    uint8_t advlen=org_adv_data_size;
    static uint8_t relay_data[32];
    uint8_t relay_size;



    while(g_userdata.size>0) //check nubmer of used block
    {
          if(g_userdata.p_data[g_userdata_currpos*MAX_USERDATA_BUFFER_BLOCKSIZE+4]==0)
          {//size of broadcast data =0 (invalid block) ->delete block, not add to history buffer
            vf_delete_block_buffer3(false);
          }
          else
          {
            //get position of data block to be transfered 
            if(g_userdata_currpos==g_userdata_lastpos) //reach lastpos -> first pos 
                g_userdata_currpos=g_userdata_firstpos;
            else
              g_userdata_currpos=g_userdata.p_data[g_userdata_currpos*MAX_USERDATA_BUFFER_BLOCKSIZE+1];

            relay_size= g_userdata.p_data[g_userdata_currpos*MAX_USERDATA_BUFFER_BLOCKSIZE+4];
            relay_data[0]=relay_size;
            relay_data[1]=0xff; //type: MANUFACTURER  
            memcpy(&relay_data[2],&g_userdata.p_data[g_userdata_currpos*MAX_USERDATA_BUFFER_BLOCKSIZE+5],relay_size);
            relay_data[5]++; //increase hop counts

            memcpy(&adv_packet.adv_data.p_data[advlen],relay_data,relay_size+1); //copy data to broadcast
            adv_packet.adv_data.len=org_adv_data_size+relay_size+1;

            if(--g_userdata.p_data[g_userdata_currpos*MAX_USERDATA_BUFFER_BLOCKSIZE+3]==0)
            { // advertised more than 2 times, then move this block to history buffer
                vf_delete_block_buffer3(true);
            }


            uart_printf("adv relay data (len)%d @%d",adv_packet.adv_data.len,g_userdata_currpos );
            j++;
            for(int i=0;i<adv_packet.adv_data.len;i++)
            {
                uart_printf("%d  ",adv_packet.adv_data.p_data[i] );
            }
            uart_printf("\n\r");
           

            break;
          }

        if(g_userdata.size==0) vf_stop_broadcast_data();

    }//while
   
}

//advertising to sink new thingy 
 /*void vf_adv_thingy_connected(ble_evt_t *p_gap_evt) 
{
//vinh doing
ble_thingy_uis_c_evt_t * p_thingy



  uint8_t data_arr[32],str1[20],i;
  uint8_array_t idata;
//vinh doing
  idata.p_data=data_arr;
  idata.p_data[0]=CLUSTER_ID; //cluster source id
  idata.p_data[1]=10; //cluster destination id
  idata.p_data[2]=g_packetID++; //packet No
  idata.p_data[3]=0; //hop counts  
  idata.p_data[4]=AGG_NODE_LINK_DATA_UPDATE; //link state 
  idata.p_data[5]=p_thingy->conn_handle; //local id
  idata.p_data[6]=12;//temp1
  idata.p_data[7]=12;//temp1
  idata.p_data[8]=34;//pressure1
  idata.p_data[9]=56;//pressure2         
  idata.p_data[10]=00;//hummi 1
  idata.p_data[11]=78;//hummi 2
  idata.size=12;

  uart_printf(" Relay Received thingy data: ");
  for(i=0;i<12;i++)
  {
    sprintf(str1,"%d ",idata.p_data[i]);
    uart_printf(str1);
  }
  uart_printf("\r\n");
  vf_add_packet_to_buffer2(&idata);
  relay_adv_data2();

