levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
      }
      if(i!=g_buff_adv_hist_lastpos)
      {
        count=1;

        sprintf(str2,"%d ",i);
        strcat(str1,str2);

        for(j=i+1;j<g_buff_adv_hist_lastpos;j++)
        {
            if(g_buff_adv_hist[j].TTL!=0)
            {
              g_buff_adv_hist[i++]=g_buff_adv_hist[j];

              sprintf(str2,"%d ",j);
              strcat(str1,str2);

            }
            else
            {
              count++;
            }

        }
        g_buff_adv_hist_lastpos=i;
        g_buff_adv_hist_size-=count;

        strcat(str1,"\n\r");
        uart_printf(str1);
      }

    }
    else
    {
      for(i=g_buff_adv_hist_firstpos;i<MAX_HIST_ADV_BUFF_SIZE;i++)
      {
          if( g_buff_adv_hist[j].TTL==0) break;

      }
      if(i!=MAX_HIST_ADV_BUFF_SIZE)
      {
        count=1;

        sprintf(str2,"%d ",i);
        strcat(str1,str2);

        for(j=i+1;j<MAX_HIST_ADV_BUFF_SIZE;j++)
        {
            if(g_buff_adv_hist[j].TTL!=0)
            {
              g_buff_adv_hist[i++]=g_buff_adv_hist[j];
              sprintf(str2,"%d ",j);
              strcat(str1,str2);

            }
            else
            {
              count++;
            }

        }
        for(j=0;j<g_buff_adv_hist_lastpos;j++)
        {
            if(g_buff_adv_hist[j].TTL!=0)
            {
              g_buff_adv_hist[i++]=g_buff_adv_hist[j];
              sprintf(str2,"%d ",j);
              strcat(str1,str2);

            }
            else
            {
              count++;
            }
            if(i>=MAX_HIST_ADV_BUFF_SIZE) i=0;

        }

        g_buff_adv_hist_lastpos=i;
        g_buff_adv_hist_size-=count;

        strcat(str1,"\n\r");
        uart_printf(str1);
      }
      else
      {
          for(i=0;i<g_buff_adv_hist_lastpos;i++)
          {
              if( g_buff_adv_hist[j].TTL==0) break;

          }
          if(i!=g_buff_adv_hist_lastpos)
          {
            count=1;
              sprintf(str2,"%d ",i);
              strcat(str1,str2);
            for(j=i+1;j<g_buff_adv_hist_lastpos;j++)
            {
                if(g_buff_adv_hist[j].TTL!=0)
                {
                  g_buff_adv_hist[i++]=g_buff_adv_hist[j];
                  sprintf(str2,"%d ",j);
                  strcat(str1,str2);
                }
                else
                {
                  count++;
                }

            }
            g_buff_adv_hist_lastpos=i;
            g_buff_adv_hist_size-=count;

            strcat(str1,"\n\r");
            uart_printf(str1);
          }
      }

    }


  


  return;


}

/*--------------------
@brief: process command from the source
    1. compare new data has been processed before by buffer of advertising history
    2. If not, process command, else quit
@input: broadcast data
*/
void vf_process_adv_command3(uint8_array_t *br_data)
{//send to phone
  //if(g_is_sink==true) vinh doing
  uint32_t ids;
  ids=(((uint32_t)br_data->p_data[0])<<16)+(((uint32_t)br_data->p_data[1])<<8)+((uint32_t)br_data->p_data[2]);

  if(vf_validate_relay_packet3(br_data)==0xFFFF)
  {//new data
    vf_app_adv_data_send_to_phone(br_data); //process -> send data to phone
    vf_add_buff_adv_hist3(ids); //add this id to history buffer
  }
  else 
    uart_printf("duplicate command \n\r");
}


/*------------
start advertising dummy data using buffer
---------*/
static void vf_start_broadcast_data(void)
{


    uint8_t buff[32];
    uint8_t i;
    uint8_array_t buffdata;
    ret_code_t err_code;
    uart_printf("add start broadcast data\n\r");
    err_code=sd_ble_gap_adv_stop(m_adv_handle);
    uart_printf("$r1 %d ",err_code);
 /*
   static bool k1=false;   
    if(k1==true)
      err_code=sd_ble_gap_adv_stop(m_adv_handle);
    else
      err_code=sd_ble_gap_adv_stop(m_adv_handle);

    uart_printf("$r1 %d ",err_code);
  nrf_delay_ms(500);
*/



    buff[0]=19; //length
    buff[1]=0xff; //type
    buff[2]=CLUSTER_ID; //source
    buff[3]=SINK_ID; //destination
    buff[4]=0x3; //Packet_no
    buff[5]=0x0; //TTL
    buff[6]=0x1; 
    buff[7]=0x2;
    buff[8]=0x3;
    buff[9]=0x4;   
    buff[10]=5;             
   buff[11]=6;
  buff[12]=7;
  buff[13]=8;
  buff[14]=9;
  buff[15]=10;
  buff[16]=11;
  buff[17]=12;
  buff[18]=13;
  buff[19]=14;
  buffdata.p_data=&buff[2];
  buffdata.size=18;
  vf_add_packet_to_buffer3(&buffdata);
  //memcpy(&adv_packet.adv_data.p_data[org_adv_data_size],buff,20);


  err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    //APP_ERROR_CHECK(err_code);
  uart_printf("$r3 %d ",err_code);
}


/*------------
start advertising dummy data directly
---------*/
static void vf_start_broadcast_data2(void)
{

    uint8_t buff[32];
    uint8_t i;
    uint8_array_t buffdata;
    ret_code_t err_code;
    uart_printf("add start broadcast data\n\r");
    err_code=sd_ble_gap_adv_stop(m_adv_handle); //stop advertising
    uart_printf("$err1 %d ",err_code); 
 /*
   static bool k1=false;   
    if(k1==true)
      err_code=sd_ble_gap_adv_stop(m_adv_handle);
    else
      err_code=sd_ble_gap_adv_stop(m_adv_handle);

    uart_printf("$r1 %d ",err_code);
  nrf_delay_ms(500);
*/



    buff[0]=19; //length
    buff[1]=0xff; //type
    buff[2]=CLUSTER_ID; //source
    buff[3]=SINK_ID; //destination
    buff[4]=0x3; //Packet_no
    buff[5]=0x0; //TTL
    buff[6]=0x1; 
    buff[7]=0x2;
    buff[8]=0x3;
    buff[9]=0x4;   
    buff[10]=5;             
   buff[11]=6;
  buff[12]=7;
  buff[13]=8;
  buff[14]=9;
  buff[15]=10;
  buff[16]=11;
  buff[17]=12;
  buff[18]=13;
  buff[19]=14;
  buffdata.p_data=&buff[0];
  buffdata.size=18;
  //vf_add_packet_to_buffer2(&buffdata);
  memcpy(&adv_packet.adv_data.p_data[org_adv_data_size],buff,20);


  err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG); //start advertising
    //APP_ERROR_CHECK(err_code);
  uart_printf("$err2 %d ",err_code);
}


static void vf_stop_broadcast_data(void)
{

    uint8_t buff[32];
    uint8_t i;
    ret_code_t err_code;
    uart_printf(" stop broadcast userdata \n\r");

