levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
    err_code=sd_ble_gap_adv_stop(m_adv_handle);
    //uart_printf("$r1 %d ",err_code);

    memset(buff,0,32);
    memcpy(&adv_packet.adv_data.p_data[org_adv_data_size],buff,20);   

       err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    //APP_ERROR_CHECK(err_code);
    //uart_printf("$r3 %d ",err_code);
}

bool vf_check_source(uint8_array_t *data)
{
  if((data->p_data[0])==CLUSTER_ID) return true;
  else return false;
}

bool vf_check_destination(uint8_array_t *data)
{
  if((data->p_data[1])==CLUSTER_ID) return true;
  else return false;
}


void vf_adv_thingy_data(thingy_data_t *data)
{


  uint8_t data_arr[32],str1[20],i;
  uint8_array_t idata;
//vinh doing

  idata.p_data=data_arr;
  idata.p_data[0]=CLUSTER_ID; //cluster source id
  idata.p_data[1]=SINK_ID; //cluster destination id
  idata.p_data[2]=g_packetID++; //packet No
  idata.p_data[3]=0; //hop counts  
  idata.p_data[4]=data->link_state; //link state 
  idata.p_data[5]=data->local_id; //local id
  switch(data->link_state)
  {
    case AGG_NODE_LINK_CONNECTED:

        idata.p_data[6]=0x12;//temp1
        idata.p_data[7]=0x12;//temp1
        idata.p_data[8]=0x34;//pressure1
        idata.p_data[9]=0x56;//pressure2         
        idata.p_data[10]=0x00;//hummi 1
        idata.p_data[11]=0x78;//hummi 2
        idata.p_data[12]=0x0;//button state
        idata.size=13;
        break;

    case AGG_NODE_LINK_DISCONNECTED:
        idata.size=6;
        break;

    case AGG_NODE_LINK_DATA_UPDATE:
        idata.p_data[6]=data->temperature>>8;//temp1
        idata.p_data[7]=(uint8_t)(data->temperature&0x00FF);//temp1
        idata.p_data[8]=data->pressure>>8;//pressure1
        idata.p_data[9]=(uint8_t)(data->pressure&0x00FF);//pressure2         
        idata.p_data[10]=data->humidity>>8;//hummi 1
        idata.p_data[11]=(uint8_t)(data->humidity&0x00FF);//hummi 2
        idata.p_data[12]=data->button;//button state
        idata.size=13;
        break;
  }


  uart_printf(" Relay Received thingy data: ");
  for(i=0;i<12;i++)
  {
    sprintf(str1,"%d ",idata.p_data[i]);
    uart_printf(str1);
  }
  uart_printf("\r\n");
  vf_add_packet_to_buffer3(&idata);
  
  //vinh ver3
 // relay_adv_data2();
}


uint8_t vf_add_packet_to_buffer(uint8_array_t *data)
{
  uint8_array_t *userdata=data;
  uint8_t err_code=0;
  size_t trim_pos,i;
  if((g_userdata.size+userdata->size+1)<=MAX_USERDATA_BUFFER)
  {//buffer not overflow
      g_userdata.size+=userdata->size+1;
      g_userdata.p_data[g_userdata_lastpos++]=userdata->size+1;

      if((g_userdata_lastpos+userdata->size)>=MAX_USERDATA_BUFFER)
      {
          memcpy(&g_userdata.p_data[g_userdata_lastpos],userdata->p_data,MAX_USERDATA_BUFFER-g_userdata_lastpos);
          trim_pos=MAX_USERDATA_BUFFER-g_userdata_lastpos;
          g_userdata_lastpos=userdata->size-(MAX_USERDATA_BUFFER-g_userdata_lastpos);
          memcpy(&g_userdata.p_data[0],&userdata->p_data[trim_pos],g_userdata_lastpos);
      }
      else
      {
         memcpy(&g_userdata.p_data[g_userdata_lastpos],userdata->p_data,userdata->size);
         g_userdata_lastpos+=userdata->size;
      }
      uart_printf("add packet to buffer");
      uart_printf("@%d $%d $%d *",g_userdata_lastpos,userdata->size,g_userdata.size);
      if(g_userdata_firstpos+g_userdata.size<MAX_USERDATA_BUFFER)
      {
          for(i=g_userdata_firstpos;i<g_userdata_firstpos+g_userdata.size;i++)
          {
           uart_printf("%d ", g_userdata.p_data[i]);
            //sprintf(str_uart, "%d ",userdata.p_data[i]);
          }
      }
      else
      {
            for(i=g_userdata_firstpos;i<MAX_USERDATA_BUFFER;i++)
            {
             uart_printf("%d ", g_userdata.p_data[i]);
            //sprintf(str_uart, "%d ",userdata.p_data[i]);
            }
            for(i=0;i<g_userdata_lastpos;i++)
            {
             uart_printf("%d ", g_userdata.p_data[i]);
            //sprintf(str_uart, "%d ",userdata.p_data[i]);
            }
      }
      uart_printf("\n\r");
  }//end buffer not full
  else
  {
    uart_printf("Buffer full");
    err_code=1;
  }
  return err_code;
}


uint8_t vf_add_packet_to_buffer2(uint8_array_t *data)
{
//each block include 32 bytes
//byte 0: block property: 0x0: free, 0xFF: used
//byte 1: pointer to next available block,0xFF is NULL
//byte 2: pointer to previous available block,0xFF is NULL
//byte 4..n:size + data
//g_userdata_lastpos: position of last block in buffer
//g_userdata_firstpos: position of last block in buffer
  uint8_array_t *userdata=data;
  uint8_t err_code=1;
  size_t pos,i;
  if((g_userdata.size)<MAX_USERDATA_BUFFER_BLOCK)
  {//buffer not overflow

      for(i=0;i<MAX_USERDATA_BUFFER_BLOCK;i++)
      {
        if(g_userdata.p_data[i*MAX_USERDATA_BUFFER_BLOCKSIZE]==0) //found free block
        {
          err_code=0;
          break;
        }
      }
      
      if(err_code==0)
      {  
      //found free block
        pos=i;
        if( g_userdata.size==0)
        {
          g_userdata.p_data[pos*32+1]=g_userdata.p_data[pos*32+2]=0xFF; 
          g_userdata_currpos=g_userdata_lastpos=g_userdata_firstpos=pos;
        }
        else
        {
          g_userdata.p_data[g_userdata_lastpos*32+1]=pos; //update previous "next block pointer"
          g_userdata.p_data[pos*32+2]=g_userdata_lastpos; //update current "pre block pointer"
          g_userdata_lastpos=pos; //update last position
        }
        g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE]=0xFF;  //mark as used block
        g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4]=userdata->size+1; //number of data byte in this block, include this byte
        memcpy(&g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5],userdata->p_data,userdata->size);
        g_userdata.size++; 
      }
  

  }//end buffer not full

  if (err_code==0)
  {
       uart_printf("@%d $%d $%d *",g_userdata.size,g_userdata_lastpos,userdata->size); 
       for(i=0;i<userdata->size+1+4;i++)
       {
          uart_printf("%d ", g_userdata.p_data[g_userdata_lastpos*MAX_USERDATA_BUFFER_BLOCKSIZE+i]);
       }
      uart_printf("\n\r");
  }
  else
  {
    uart_printf("Buffer full");
  }
  return err_code;
}


/*--------------------------------
@brief: add broadcast data to buffer for advertising
@input: user data in *data
@output: return value 0: success, 1: buffer full

data is coupled into buffer at the posiont pointed by g_userdata_lastpos

Structure of a block (32 bytes)
  byte 0: block property: 0x0: free, 0xFF: used
  byte 1: pointer to next available block,0xFF is NULL
  byte 2: pointer to previous available block,0xFF is NULL
  byte 3: number of advertsing times before removing
  byte 4: size (=(size of broadcase data)+1)
  byte 5..n: broadcast data
          broadcast data (br_data)
            byte 0: source id
            byte 1: destination id
            byte 2: packet id
            byte 3: hop counts
            byte 4..18: user data 

//g_userdata_lastpos: position of last block in buffer
//g_userdata_firstpos: position of last block in buffer
//g_userdata_currpos: position of current block which is adverting
//g_userdata : buffer
---------*/

uint8_t vf_add_packet_to_buffer3(uint8_array_t *br_data)
{

